import React, {Component} from 'react';
import {View,Text} from 'native-base';

class StoryOne extends Component {
    render() {
        return (
            <View testID="1">
                <Text style={{margin:10,alignItems:'center'}}>এক বালক গোপালের বাগানে ফল পেড়ে খাচ্ছিল। প্রতিবেশী লোকেরা ছেলেটাকে ধরে নিয়ে এল বাগান থেকে। যথাসময়ে ছেলেটাকে গোপালের কাছে ধরে নিয়ে এসে হাজির করল। ছেলেটার বিচার করবার জন্য গোপালকে বলল দৈব ক্রমে সেই সময় মহারাজ কৃষ্ণচন্দ্র আর প্রিয়বয়স্য গোপালের বাড়িতে উপস্থিত ছিলেন। তার জন্য গোপাল ও সবিনয় মহারাজের উপর বিচারের ভার ছেড়ে দিল।
                    মহারাজ খুব গম্ভীর হয়ে সেই বালককে লক্ষ্য করে কয়েকটি উপদেশের বানী শুনালেন। চুরি করা ভীষণ দোষ, কারো কোন জিনিষ চুরি করা উচিৎ নয়। যে কোন লোক চুরি করলে ভীষণ শাস্তি পেতে হয়। এইরূপ অনেক কিছু কথা বলার পর মহারাজ সেই বালককে জিজ্ঞাসা করলেন, আচ্ছা তোমার যদি একটা বাগান থাকত আর সেই বাগানে ঢুকে তোমার মত কোন ছেলে যদি ফল চুরি করত তখন তুমি তাকে কি করতে তোমার মুখেই শুনতে চাই বলত দেখি?
                    বালক বিনিত হয়ে নম্রভাবে বলল, মহারাজ প্রথমবার আর কি করব? বুঝিয়ে সুঝিয়ে সে যাতে আর কোন দিন চুরি না করে এবং আপনার মত এই উপদেশের কথামত বলে সাবধান করে ছেড়ে দিতারম প্রথম বারের মত। তা ছাড়া আর কি করব বলুন।
                    বালকের এই কথা শুনে মহারাজ হেসে ফেললেন, মনে মনে ভাবলেন বাঃ ছেলের বিচার বুদ্ধি দেখছি বেশ সুন্দর, ঠিক আছে ওর কথা মত এবার একে সাবধান করে ছেড়ে দেওয়া হোক।
                    বলা বাহুল্য মহারাজ সাবধান করে বালককে ছেড়ে দিলেন। দেখো আর যেন দ্বিতীয়বার তোমার কথামত কোনদিন যেন চুরি না কর। এবারের মত তোমাকে মাফ করে দেওয়া হল তোমারই কথামত। </Text>
             </View>
        );
    }
}

export default StoryOne;
